IDENTIFICATION DIVISION.
       PROGRAM-ID. BASE-DATOS-INDEXADA.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT OPTIONAL ARCHIVO-EMP
       ASSIGN TO "c:/cobol/nuevabase10.cob"
       ORGANIZATION IS INDEXED RECORD KEY IS EMP-ID
       ACCESS MODE IS DYNAMIC.
       DATA DIVISION.
       FILE SECTION.
        FD  ARCHIVO-EMP.
           01 CAMPOS-EMPLEADOS.
               02 EMP-ID PIC 9(6).
               02 EMP-NOMBRE PIC X(10).
               02 EMP-APELLIDO PIC X(15).
               02 EMP-DIRECCION PIC X(15).
               02 EMP-TELEFONO PIC X(10).


       WORKING-STORAGE SECTION.
       77  SI-NO PIC X.
       77  CHANGER PIC X.
       PROCEDURE DIVISION.


       OPEN I-O ARCHIVO-EMP.
       COMIENZO.
       DISPLAY "BIENVENIDO INGRESE DATOS DE EMPLEADOS."
       DISPLAY "ID:".
       ACCEPT EMP-ID.
       DISPLAY "NOMBRE:"
       ACCEPT EMP-NOMBRE.
       DISPLAY "APELLIDO:"
       ACCEPT EMP-APELLIDO.
       DISPLAY "DIRECCION:".
       ACCEPT EMP-DIRECCION.
       DISPLAY "TELEFONO:".
       ACCEPT EMP-TELEFONO.
       WRITE CAMPOS-EMPLEADOS.

       DISPLAY "DESEA AGREGAR OTRO EMPLEADO?"
       ACCEPT SI-NO.
       IF SI-NO="s"
           MOVE "S" TO SI-NO.

       IF SI-NO="S"
           PERFORM COMIENZO
       ELSE
           CLOSE ARCHIVO-EMP.
           STOP RUN.
