IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT OPTIONAL ARCHIVO-EMP ASSIGN TO
       "c:/cobol/nuevabase10.cob"
       ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  ARCHIVO-EMP.
           01 CAMPOS-EMPLEADOS.
               02 EMPLEADOS-NOMBRE PIC X(15).
               02 EMPLEADOS-APE PIC X(25).
               02 EMPLEADOS-EDAD PIC XX.

       WORKING-STORAGE SECTION.
       77  NOMBRE-EMP PIC X(15).
       77  APE-EMP PIC X(25).
       77  EDAD-EMP PIC XX.
       77  CONTADOR PIC 99.
       77  SI-NO PIC X.
       77  FINALIZAR PIC X.

       PROCEDURE DIVISION.


       OPEN INPUT ARCHIVO-EMP.
       READ ARCHIVO-EMP.
       COMIENZO.
           MOVE EMPLEADOS-NOMBRE TO NOMBRE-EMP.
           MOVE EMPLEADOS-APE TO APE-EMP.
           MOVE EMPLEADOS-EDAD TO EDAD-EMP.
           DISPLAY "NOMBRE: ", NOMBRE-EMP
           "APELLIDO: ", APE-EMP
           "EDAD: ", EDAD-EMP.
           READ ARCHIVO-EMP NEXT RECORD AT END MOVE "1" to FINALIZAR.

       ADD 1 TO CONTADOR.
       IF CONTADOR < 10
           PERFORM COMIENZO UNTIL FINALIZAR="1".
       DISPLAY "DESEA VER MÁS ARCHIVOS?".
       ACCEPT SI-NO.
       IF SI-NO="s"
           MOVE 0 TO CONTADOR
           PERFORM COMIENZO
           PERFORM FIN
       ELSE
           PERFORM FIN.
       FIN.
       CLOSE ARCHIVO-EMP
       STOP RUN.
